micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rtc.c
/**
  ******************************************************************************
  * @file    stm32n6xx_hal_rtc.c
  * @author  GPM Application Team
  * @brief   RTC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Real-Time Clock (RTC) peripheral:
  *           + Initialization/de-initialization functions
  *           + Calendar (Time and Date) configuration
  *           + Alarms (Alarm A and Alarm B) configuration
  *           + WakeUp Timer configuration
  *           + TimeStamp configuration
  *           + Tampers configuration
  *           + Backup Data Registers configuration
  *           + RTC Tamper and TimeStamp Pins Selection
  *           + Interrupts and flags management
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
 ===============================================================================
                          ##### RTC Operating Condition #####
 ===============================================================================
  [..] The real-time clock (RTC) and the RTC backup registers can be powered
       from the VBAT voltage when the main VDD supply is powered off.
       To retain the content of the RTC backup registers and supply the RTC
       when VDD is turned off, VBAT pin can be connected to an optional
       standby voltage supplied by a battery or by another source.

                   ##### Backup Domain Reset #####
 ===============================================================================
  [..] The backup domain reset sets all RTC registers and the RCC_BDCR register
       to their reset values.
       A backup domain reset is generated when one of the following events occurs:
    (#) Software reset, triggered by setting the BDRST bit in the
        RCC Backup domain control register (RCC_BDCR).
    (#) VDD or VBAT power on, if both supplies have previously been powered off.
    (#) Tamper detection event resets all data backup registers.

                   ##### Backup Domain Access #####
  ==================================================================
  [..] After reset, the backup domain (RTC registers and RTC backup data registers)
       is protected against possible unwanted write accesses.
  [..] To enable access to the RTC Domain and RTC registers, proceed as follows:
    (+) Enable access to RTC domain using the HAL_PWR_EnableBkUpAccess() function.
    (+) Call the function HAL_RCCEx_PeriphCLKConfig with RCC_PERIPHCLK_RTC for
        PeriphClockSelection and select RTCClockSelection (LSE, LSI or HSEdiv32)
    (+) Enable RTC Clock using the __HAL_RCC_RTC_ENABLE() function.

                  ##### How to use RTC Driver #####
 ===================================================================
  [..]
    (+) Enable the RTC domain access (see description in the section above).
    (+) Configure the RTC Prescaler (Asynchronous and Synchronous) and RTC hour
        format using the HAL_RTC_Init() function.

  *** Time and Date configuration ***
  ===================================
  [..]
    (+) To configure the RTC Calendar (Time and Date) use the HAL_RTC_SetTime()
        and HAL_RTC_SetDate() functions.
    (+) To read the RTC Calendar, use the HAL_RTC_GetTime() and HAL_RTC_GetDate() functions.

  *** Alarm configuration ***
  ===========================
  [..]
    (+) To configure the RTC Alarm use the HAL_RTC_SetAlarm() function.
            You can also configure the RTC Alarm with interrupt mode using the
            HAL_RTC_SetAlarm_IT() function.
    (+) To read the RTC Alarm, use the HAL_RTC_GetAlarm() function.

                  ##### RTC and low power modes #####
  ==================================================================
  [..] The MCU can be woken up from a low power mode by an RTC alternate
       function.
  [..] The RTC alternate functions are the RTC alarms (Alarm A and Alarm B),
       RTC wakeup, RTC tamper event detection and RTC time stamp event detection.
       These RTC alternate functions can wake up the system from the Stop and
       Standby low power modes.
  [..] The system can also wake up from low power modes without depending
       on an external interrupt (Auto-wakeup mode), by using the RTC alarm
       or the RTC wakeup events.
  [..] The RTC provides a programmable time base for waking up from the
       Stop or Standby mode at regular intervals.
       Wakeup from STOP and STANDBY modes is possible only when the RTC clock source
       is LSE or LSI.

  *** Callback registration ***
  =============================================
  When The compilation define USE_HAL_RTC_REGISTER_CALLBACKS is set to 0 or
  not defined, the callback registration feature is not available and all callbacks
  are set to the corresponding weak functions. This is the recommended configuration
  in order to optimize memory/code consumption footprint/performances.

  The compilation define USE_RTC_REGISTER_CALLBACKS when set to 1
  allows the user to configure dynamically the driver callbacks.
  Use Function HAL_RTC_RegisterCallback() to register an interrupt callback.

  Function HAL_RTC_RegisterCallback() allows to register following callbacks:
    (+) AlarmAEventCallback             : RTC Alarm A Event callback.
    (+) AlarmBEventCallback             : RTC Alarm B Event callback.
    (+) TimeStampEventCallback          : RTC TimeStamp Event callback.
    (+) WakeUpTimerEventCallback        : RTC WakeUpTimer Event callback.
    (+) SSRUEventCallback               : RTC SSRU Event callback.
    (+) Tamper1EventCallback            : RTC Tamper 1 Event callback.
    (+) Tamper2EventCallback            : RTC Tamper 2 Event callback.
    (+) Tamper3EventCallback            : RTC Tamper 3 Event callback.
    (+) Tamper4EventCallback            : RTC Tamper 4 Event callback.
    (+) Tamper5EventCallback            : RTC Tamper 5 Event callback.
    (+) Tamper6EventCallback            : RTC Tamper 6 Event callback.
    (+) Tamper7EventCallback            : RTC Tamper 7 Event callback.
    (+) Tamper8EventCallback            : RTC Tamper 8 Event callback.
    (+) InternalTamper1EventCallback    : RTC InternalTamper 1 Event callback.
    (+) InternalTamper2EventCallback    : RTC InternalTamper 2 Event callback.
    (+) InternalTamper3EventCallback    : RTC InternalTamper 3 Event callback.
    (+) InternalTamper4EventCallback    : RTC InternalTamper 4 Event callback.
    (+) InternalTamper5EventCallback    : RTC InternalTamper 5 Event callback.
    (+) InternalTamper6EventCallback    : RTC InternalTamper 6 Event callback.
    (+) InternalTamper7EventCallback    : RTC InternalTamper 7 Event callback.
    (+) InternalTamper8EventCallback    : RTC InternalTamper 8 Event callback.
    (+) InternalTamper9EventCallback    : RTC InternalTamper 9 Event callback.
    (+) InternalTamper11EventCallback   : RTC InternalTamper 11 Event callback.
    (+) MspInitCallback                 : RTC MspInit callback.
    (+) MspDeInitCallback               : RTC MspDeInit callback.
  This function takes as parameters the HAL peripheral handle, the Callback ID
  and a pointer to the user callback function.

  Use function HAL_RTC_UnRegisterCallback() to reset a callback to the default
  weak function.
  HAL_RTC_UnRegisterCallback() takes as parameters the HAL peripheral handle,
  and the Callback ID.
  This function allows to reset following callbacks:
    (+) AlarmAEventCallback             : RTC Alarm A Event callback.
    (+) AlarmBEventCallback             : RTC Alarm B Event callback.
    (+) TimeStampEventCallback          : RTC TimeStamp Event callback.
    (+) WakeUpTimerEventCallback        : RTC WakeUpTimer Event callback.
    (+) SSRUEventCallback               : RTC SSRU Event callback.
    (+) Tamper1EventCallback            : RTC Tamper 1 Event callback.
    (+) Tamper2EventCallback            : RTC Tamper 2 Event callback.
    (+) Tamper3EventCallback            : RTC Tamper 3 Event callback.
    (+) Tamper4EventCallback            : RTC Tamper 4 Event callback.
    (+) Tamper5EventCallback            : RTC Tamper 5 Event callback.
    (+) Tamper6EventCallback            : RTC Tamper 6 Event callback.
    (+) Tamper7EventCallback            : RTC Tamper 7 Event callback.
    (+) Tamper8EventCallback            : RTC Tamper 8 Event callback.
    (+) InternalTamper1EventCallback    : RTC InternalTamper 1 Event callback.
    (+) InternalTamper2EventCallback    : RTC InternalTamper 2 Event callback.
    (+) InternalTamper3EventCallback    : RTC InternalTamper 3 Event callback.
    (+) InternalTamper4EventCallback    : RTC InternalTamper 4 Event callback.
    (+) InternalTamper5EventCallback    : RTC InternalTamper 5 Event callback.
    (+) InternalTamper6EventCallback    : RTC InternalTamper 6 Event callback.
    (+) InternalTamper7EventCallback    : RTC InternalTamper 7 Event callback.
    (+) InternalTamper8EventCallback    : RTC InternalTamper 8 Event callback.
    (+) InternalTamper9EventCallback    : RTC InternalTamper 9 Event callback.
    (+) InternalTamper11EventCallback   : RTC InternalTamper 11 Event callback.
    (+) MspInitCallback                 : RTC MspInit callback.
    (+) MspDeInitCallback               : RTC MspDeInit callback.

